/// status : 200
/// data : {"news":[{"title":"\"الاردني الهاشمي للتنمية\" يطلق مسابقة تصاميم ابداعية للمباني الخضراء","body":"عمون - اطلق الصندوق الاردني الهاشمي للتنمية البشرية اليوم الاربعاء، مسابقة تصميم ابداعية للمباني الخضراء ( JO-GREEN ) للعام 2017.وتستهدف المسابقة تصميم عمارة سكنية لخدمة ذوي الدخل المحدود لتكون اول عمارة سكنية خضراء في الاردن في حال تنفيذها ومتوافقة مع معايير البناء الاخضر، لتحقق نقلة نوعية في قطاع البناء والحفاظ على الموارد الطبيعية والبيئية والطاقة والمياه.وقال رئيس لجنة اعداد وتنظيم المسابقة الدكتور جمال قطيشات، في مؤتمر صحفي بمقر الصندوق، ان المسابقة تستهدف فئة الشباب من طلبة الكليات الهندسية في الجامعات الأردنية وتحفيزهم لإيجاد حلول هندسية مبتكرة للتعامل مع التحديات البيئية والاقتصادية وتوظيف مفاهيم وتطبيقات البناء الاخضر، وبما يتناسب مع عناصر العمارة المحلية.ويأتي اطلاق المسابقة في دروتها التاسعة من قبل الصندوق بحسب الدكتور قطيشات، في اطار الجهود الوطنية المبذولة لنشر الوعي البيئي ومفاهيم البناء الاخضر بين طلبة كليات الهندسة في الجامعات الاردنية العامة والخاصة، وتحفيزهم للعمل ضمن فرق متعددة التخصصات واتاحة الفرص امامهم لاختبار قدراتهم وصقل مواهبهم ومهاراتهم الابداعية والخلاقة في البحث والتصميم باعتبارهم مهندسي المستقبل والقادرين على احداث تحول ايجابي نحو مبان صديقة للبيئة، موفرة للطاقة وتتوافر فيها تقنيات لحسن ادارة المياه وترشيد استهلاك الطاقة.وعرض قطيشات لآلية الترشح للمسابقة اعتبارا من اليوم عبر الموقع الالكتروني للمسابقة ( www.qac.jo)، مبينا ان آخر موعد لتسليم التصاميم المشاركة سيكون في الاول من شهر تشرين الثاني المقبل، بحيث سيتم في الثلاثين من الشهر ذاته الاعلان عن اسماء الفائزين في المسابقة من الطلبة والجامعات.واضاف انه تم تخصيص ثلاث جوائز لأفضل التصاميم المحققة لمتطلبات المعايير المعمارية والمدنية والميكانيكية والكهربائية الواردة في دليل المباني الخضراء الاردني، بواقع 2000 دينار للجائزة الاولى، و1500 دينار للجائزة الثانية و 1000 دينار للجائزة الثالثة.وبين انه سيتم بالتعاون مع الجامعات المعنية تنظيم مجموعة من المحاضرات حول مفاهيم وتطبيقات البناء الاخضر ودليل المباني الخضراء الاردني الذي صدر اخيرا عن مجلس البناء الوطني، بهدف بناء قدرات الطلبة وتزويدهم بالمتطلبات الالزامية والواجبة والاختيارية الواردة في الدليل، مشيرا الى انه سيتم تقييم التصاميم المشاركة وفقا لنظام تقييم المباني الخضراء الوارد في دليل المباني الخضراء الاردني والمتطلبات الالزامية الواجبة والاختيارية المتعلقة بالتصميم.واشاد بتفاعل الجامعات الاردنية المختلفة وطلبتها مع المسابقة في دوراتها السابقة، مشيرا كذلك الى دور وسائل الاعلام المختلفة في التعريف بالمسابقة والتوعوية باهدافها.ودعا الطلبة لزيارة الموقع الالكتروني للمسابقة للاطلاع على شروط المشاركة فيها وطبيعة الوثائق والتصاميم المطلوبة ومعايير تقييم المشاريع المقدمة من قبل الطلبة وكيفية تطوير وتقديم المشروع.","date":"2022-09-21 00:00:00","images":["https://qac.jo/sites/default/files/2022-09/Image_636355063665683668.jpg","https://qac.jo/sites/default/files/2022-09/image%20%284%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%282%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%283%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%281%29.jpg"]}]}

class NewsArticleModel {
  NewsArticleModel({
    int? status,
    Data? data,
  }) {
    _status = status;
    _data = data;
  }

  NewsArticleModel.fromJson(dynamic json) {
    _status = json['status'];
    _data = json['data'] != null ? Data.fromJson(json['data']) : null;
  }
  int? _status;
  Data? _data;
  NewsArticleModel copyWith({
    int? status,
    Data? data,
  }) =>
      NewsArticleModel(
        status: status ?? _status,
        data: data ?? _data,
      );
  int? get status => _status;
  Data? get data => _data;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['status'] = _status;
    if (_data != null) {
      map['data'] = _data?.toJson();
    }
    return map;
  }
}

/// news : [{"title":"\"الاردني الهاشمي للتنمية\" يطلق مسابقة تصاميم ابداعية للمباني الخضراء","body":"عمون - اطلق الصندوق الاردني الهاشمي للتنمية البشرية اليوم الاربعاء، مسابقة تصميم ابداعية للمباني الخضراء ( JO-GREEN ) للعام 2017.وتستهدف المسابقة تصميم عمارة سكنية لخدمة ذوي الدخل المحدود لتكون اول عمارة سكنية خضراء في الاردن في حال تنفيذها ومتوافقة مع معايير البناء الاخضر، لتحقق نقلة نوعية في قطاع البناء والحفاظ على الموارد الطبيعية والبيئية والطاقة والمياه.وقال رئيس لجنة اعداد وتنظيم المسابقة الدكتور جمال قطيشات، في مؤتمر صحفي بمقر الصندوق، ان المسابقة تستهدف فئة الشباب من طلبة الكليات الهندسية في الجامعات الأردنية وتحفيزهم لإيجاد حلول هندسية مبتكرة للتعامل مع التحديات البيئية والاقتصادية وتوظيف مفاهيم وتطبيقات البناء الاخضر، وبما يتناسب مع عناصر العمارة المحلية.ويأتي اطلاق المسابقة في دروتها التاسعة من قبل الصندوق بحسب الدكتور قطيشات، في اطار الجهود الوطنية المبذولة لنشر الوعي البيئي ومفاهيم البناء الاخضر بين طلبة كليات الهندسة في الجامعات الاردنية العامة والخاصة، وتحفيزهم للعمل ضمن فرق متعددة التخصصات واتاحة الفرص امامهم لاختبار قدراتهم وصقل مواهبهم ومهاراتهم الابداعية والخلاقة في البحث والتصميم باعتبارهم مهندسي المستقبل والقادرين على احداث تحول ايجابي نحو مبان صديقة للبيئة، موفرة للطاقة وتتوافر فيها تقنيات لحسن ادارة المياه وترشيد استهلاك الطاقة.وعرض قطيشات لآلية الترشح للمسابقة اعتبارا من اليوم عبر الموقع الالكتروني للمسابقة ( www.qac.jo)، مبينا ان آخر موعد لتسليم التصاميم المشاركة سيكون في الاول من شهر تشرين الثاني المقبل، بحيث سيتم في الثلاثين من الشهر ذاته الاعلان عن اسماء الفائزين في المسابقة من الطلبة والجامعات.واضاف انه تم تخصيص ثلاث جوائز لأفضل التصاميم المحققة لمتطلبات المعايير المعمارية والمدنية والميكانيكية والكهربائية الواردة في دليل المباني الخضراء الاردني، بواقع 2000 دينار للجائزة الاولى، و1500 دينار للجائزة الثانية و 1000 دينار للجائزة الثالثة.وبين انه سيتم بالتعاون مع الجامعات المعنية تنظيم مجموعة من المحاضرات حول مفاهيم وتطبيقات البناء الاخضر ودليل المباني الخضراء الاردني الذي صدر اخيرا عن مجلس البناء الوطني، بهدف بناء قدرات الطلبة وتزويدهم بالمتطلبات الالزامية والواجبة والاختيارية الواردة في الدليل، مشيرا الى انه سيتم تقييم التصاميم المشاركة وفقا لنظام تقييم المباني الخضراء الوارد في دليل المباني الخضراء الاردني والمتطلبات الالزامية الواجبة والاختيارية المتعلقة بالتصميم.واشاد بتفاعل الجامعات الاردنية المختلفة وطلبتها مع المسابقة في دوراتها السابقة، مشيرا كذلك الى دور وسائل الاعلام المختلفة في التعريف بالمسابقة والتوعوية باهدافها.ودعا الطلبة لزيارة الموقع الالكتروني للمسابقة للاطلاع على شروط المشاركة فيها وطبيعة الوثائق والتصاميم المطلوبة ومعايير تقييم المشاريع المقدمة من قبل الطلبة وكيفية تطوير وتقديم المشروع.","date":"2022-09-21 00:00:00","images":["https://qac.jo/sites/default/files/2022-09/Image_636355063665683668.jpg","https://qac.jo/sites/default/files/2022-09/image%20%284%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%282%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%283%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%281%29.jpg"]}]

class Data {
  Data({
    List<News>? news,
  }) {
    _news = news;
  }

  Data.fromJson(dynamic json) {
    if (json['news'] != null) {
      _news = [];
      json['news'].forEach((v) {
        _news?.add(News.fromJson(v));
      });
    }
  }
  List<News>? _news;
  Data copyWith({
    List<News>? news,
  }) =>
      Data(
        news: news ?? _news,
      );
  List<News>? get news => _news;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    if (_news != null) {
      map['news'] = _news?.map((v) => v.toJson()).toList();
    }
    return map;
  }
}

/// title : "\"الاردني الهاشمي للتنمية\" يطلق مسابقة تصاميم ابداعية للمباني الخضراء"
/// body : "عمون - اطلق الصندوق الاردني الهاشمي للتنمية البشرية اليوم الاربعاء، مسابقة تصميم ابداعية للمباني الخضراء ( JO-GREEN ) للعام 2017.وتستهدف المسابقة تصميم عمارة سكنية لخدمة ذوي الدخل المحدود لتكون اول عمارة سكنية خضراء في الاردن في حال تنفيذها ومتوافقة مع معايير البناء الاخضر، لتحقق نقلة نوعية في قطاع البناء والحفاظ على الموارد الطبيعية والبيئية والطاقة والمياه.وقال رئيس لجنة اعداد وتنظيم المسابقة الدكتور جمال قطيشات، في مؤتمر صحفي بمقر الصندوق، ان المسابقة تستهدف فئة الشباب من طلبة الكليات الهندسية في الجامعات الأردنية وتحفيزهم لإيجاد حلول هندسية مبتكرة للتعامل مع التحديات البيئية والاقتصادية وتوظيف مفاهيم وتطبيقات البناء الاخضر، وبما يتناسب مع عناصر العمارة المحلية.ويأتي اطلاق المسابقة في دروتها التاسعة من قبل الصندوق بحسب الدكتور قطيشات، في اطار الجهود الوطنية المبذولة لنشر الوعي البيئي ومفاهيم البناء الاخضر بين طلبة كليات الهندسة في الجامعات الاردنية العامة والخاصة، وتحفيزهم للعمل ضمن فرق متعددة التخصصات واتاحة الفرص امامهم لاختبار قدراتهم وصقل مواهبهم ومهاراتهم الابداعية والخلاقة في البحث والتصميم باعتبارهم مهندسي المستقبل والقادرين على احداث تحول ايجابي نحو مبان صديقة للبيئة، موفرة للطاقة وتتوافر فيها تقنيات لحسن ادارة المياه وترشيد استهلاك الطاقة.وعرض قطيشات لآلية الترشح للمسابقة اعتبارا من اليوم عبر الموقع الالكتروني للمسابقة ( www.qac.jo)، مبينا ان آخر موعد لتسليم التصاميم المشاركة سيكون في الاول من شهر تشرين الثاني المقبل، بحيث سيتم في الثلاثين من الشهر ذاته الاعلان عن اسماء الفائزين في المسابقة من الطلبة والجامعات.واضاف انه تم تخصيص ثلاث جوائز لأفضل التصاميم المحققة لمتطلبات المعايير المعمارية والمدنية والميكانيكية والكهربائية الواردة في دليل المباني الخضراء الاردني، بواقع 2000 دينار للجائزة الاولى، و1500 دينار للجائزة الثانية و 1000 دينار للجائزة الثالثة.وبين انه سيتم بالتعاون مع الجامعات المعنية تنظيم مجموعة من المحاضرات حول مفاهيم وتطبيقات البناء الاخضر ودليل المباني الخضراء الاردني الذي صدر اخيرا عن مجلس البناء الوطني، بهدف بناء قدرات الطلبة وتزويدهم بالمتطلبات الالزامية والواجبة والاختيارية الواردة في الدليل، مشيرا الى انه سيتم تقييم التصاميم المشاركة وفقا لنظام تقييم المباني الخضراء الوارد في دليل المباني الخضراء الاردني والمتطلبات الالزامية الواجبة والاختيارية المتعلقة بالتصميم.واشاد بتفاعل الجامعات الاردنية المختلفة وطلبتها مع المسابقة في دوراتها السابقة، مشيرا كذلك الى دور وسائل الاعلام المختلفة في التعريف بالمسابقة والتوعوية باهدافها.ودعا الطلبة لزيارة الموقع الالكتروني للمسابقة للاطلاع على شروط المشاركة فيها وطبيعة الوثائق والتصاميم المطلوبة ومعايير تقييم المشاريع المقدمة من قبل الطلبة وكيفية تطوير وتقديم المشروع."
/// date : "2022-09-21 00:00:00"
/// images : ["https://qac.jo/sites/default/files/2022-09/Image_636355063665683668.jpg","https://qac.jo/sites/default/files/2022-09/image%20%284%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%282%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%283%29.jpg","https://qac.jo/sites/default/files/2022-09/image%20%281%29.jpg"]

class News {
  News({
    String? title,
    String? body,
    String? date,
    List<String>? images,
  }) {
    _title = title;
    _body = body;
    _date = date;
    _images = images;
  }

  News.fromJson(dynamic json) {
    _title = json['title'];
    _body = json['body'];
    _date = json['date'];
    _images = json['images'] != null ? json['images'].cast<String>() : [];
  }
  String? _title;
  String? _body;
  String? _date;
  List<String>? _images;
  News copyWith({
    String? title,
    String? body,
    String? date,
    List<String>? images,
  }) =>
      News(
        title: title ?? _title,
        body: body ?? _body,
        date: date ?? _date,
        images: images ?? _images,
      );
  String? get title => _title;
  String? get body => _body;
  String? get date => _date;
  List<String>? get images => _images;

  Map<String, dynamic> toJson() {
    final map = <String, dynamic>{};
    map['title'] = _title;
    map['body'] = _body;
    map['date'] = _date;
    map['images'] = _images;
    return map;
  }
}
